avrxml/asf/avr32/services/network/lin/lin.c
/*****************************************************************************
 *
 * \file
 *
 * \brief LIN service for AVR32 UC3.
 *
 * This file contains basic functions for the AVR32 USART, with support for all
 * modes, settings and clock speeds.
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 ******************************************************************************/
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#include <stdio.h>
#include <string.h>
#include "compiler.h"
#include "intc.h"
#include "pdca.h"
#include "gpio.h"
#include "lin.h"
//_____ D E F I N I T I O N S __________________________________________________

//_____ D E C L A R A T I O N S ________________________________________________
// Array of structure of type:'st_lin_message'
volatile st_lin_message   lin_descript_list_node0[NUMBER_OF_LIN_FRAMES_NODE0];
#ifdef USART_LIN_NODE1_INSTANCE
volatile st_lin_message   lin_descript_list_node1[NUMBER_OF_LIN_FRAMES_NODE1];
#endif

// Index in lin_descript_list[]
volatile U8  lin_handle_node0 = 0xFF;
#ifdef USART_LIN_NODE1_INSTANCE
volatile U8  lin_handle_node1 = 0xFF;
#endif

// Error counter
volatile U16  lin_error_number_node0 = 0;
#ifdef USART_LIN_NODE1_INSTANCE
volatile U16  lin_error_number_node1 = 0;
#endif

// Last error[n]: lin_handle | status - length = 4
volatile U16  lin_last_errors_node0[LIN_LAST_ERR_LENGHT];
#ifdef USART_LIN_NODE1_INSTANCE
volatile U16  lin_last_errors_node1[LIN_LAST_ERR_LENGHT];
#endif

// Tx Buffer message
U8 lin_tx_buffer_node0[256];
#ifdef USART_LIN_NODE1_INSTANCE
U8 lin_tx_buffer_node1[256];
#endif

// Rx Buffer message
volatile U8 lin_rx_buffer_node0[256];
#ifdef USART_LIN_NODE1_INSTANCE
volatile U8 lin_rx_buffer_node1[256];
#endif

//! Map of the LIN pins used
static const gpio_map_t USART_LIN_NODE0_GPIO_MAP =
{
  {USART_LIN_NODE0_RX_PIN, USART_LIN_NODE0_RX_FUNCTION},
  {USART_LIN_NODE0_TX_PIN, USART_LIN_NODE0_TX_FUNCTION}
};

#ifdef USART_LIN_NODE1_INSTANCE
static const gpio_map_t USART_LIN_NODE1_GPIO_MAP =
{
  {USART_LIN_NODE1_RX_PIN, USART_LIN_NODE1_RX_FUNCTION},
  {USART_LIN_NODE1_TX_PIN, USART_LIN_NODE1_TX_FUNCTION}
};
#endif

//! Instance of the USART IP used
volatile avr32_usart_t* usart_lin_node0 = &USART_LIN_NODE0_INSTANCE;
#ifdef USART_LIN_NODE1_INSTANCE
volatile avr32_usart_t* usart_lin_node1 = &USART_LIN_NODE1_INSTANCE;
#endif

//_____ F U N C T I O N S ______________________________________________________

static U8   lin_rx_response( U8 l_node, U8 l_handle, U8 l_len);
static U8   lin_tx_response( U8 l_node, U8 l_handle, U8 *l_data, U8 l_len) ;
static void lin_get_response(U8 l_node, U8 *l_data);
static U8   lin_tx_header_and_response(U8 l_node, U8 l_handle, U8 l_len);

/*! \brief LIN TX PDCA interrupt handler.
 */
#if defined (__GNUC__) && defined (__AVR32__)
__attribute__((__interrupt__))
#elif defined (__ICCAVR32__)
#pragma handler = USART_LIN_NODE0_TX_PDCA_IRQ_GROUP, USART_LIN_NODE0_TX_PDCA_CHANNEL
__interrupt
#endif
static void lin_pdca_int_tx_handler_node0(void)
{
  U8 index = 0;
  U8 l_handle = 0xFF;

  // Check ID Value for the current message
  for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE0; index ++) {
      if(lin_descript_list_node0[index].l_id == usart_lin_get_id_char(usart_lin_node0)) {
          l_handle = index;
              break;
      }
  }
  // Check if the ID received is registered into the lin description list
  if (l_handle!=0xFF)
  {
    if (pdca_get_transfer_status(USART_LIN_NODE0_TX_PDCA_CHANNEL)&PDCA_TRANSFER_COMPLETE)
    {
        pdca_disable_interrupt_transfer_complete(USART_LIN_NODE0_TX_PDCA_CHANNEL);
        // Start of the associated task
        lin_descript_list_node0[l_handle].l_pt_function(lin_descript_list_node0[l_handle].l_pt_data);
        lin_handle_node0 = 0xFF;  // End of communication
    }
  }
}

/*! \brief USART LIN RX PDCA interrupt handler.
 */
#if defined (__GNUC__) && defined (__AVR32__)
__attribute__((__interrupt__))
#elif defined (__ICCAVR32__)
#pragma handler = USART_LIN_NODE0_RX_PDCA_IRQ_GROUP, USART_LIN_NODE0_RX_PDCA_CHANNEL
__interrupt
#endif
static void lin_pdca_int_rx_handler_node0(void)
{
  U8 index = 0;
  U8 l_handle = 0xFF;
  // Check ID Value for the current message
  for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE0; index ++) {
      if(lin_descript_list_node0[index].l_id == usart_lin_get_id_char(usart_lin_node0)) {
          l_handle = index;
              break;
      }
  }
  // Check if the ID received is registered into the lin description list
  if (l_handle!=0xFF)
  {
    if (pdca_get_transfer_status(USART_LIN_NODE0_RX_PDCA_CHANNEL)&PDCA_TRANSFER_COMPLETE)
    {
        pdca_disable_interrupt_transfer_complete(USART_LIN_NODE0_RX_PDCA_CHANNEL);
        lin_get_response (0,lin_descript_list_node0[l_handle].l_pt_data);
        // Start of the associated task
        lin_descript_list_node0[l_handle].l_pt_function(lin_descript_list_node0[l_handle].l_pt_data);
        lin_handle_node0 = 0xFF;  // End of communication
    }
  }
}
/*! \brief USART LIN interrupt handler: manage ID reception and ERROR
 */
#if defined (__GNUC__) && defined (__AVR32__)
__attribute__((__interrupt__))
#elif defined (__ICCAVR32__)
__interrupt
#endif
static void lin_int_handler_node0(void)
{
    U32 l_error;
    U8 index;
    U8 l_handle = 0xFF;
    // Check ID Value for the current message
    for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE0; index ++)
    {
        if(lin_descript_list_node0[index].l_id == usart_lin_get_id_char(usart_lin_node0))
        {
            l_handle = index;
                break;
        }
    }
    // Check Error Status
    l_error = usart_lin_get_error(usart_lin_node0);
    usart_reset_status(usart_lin_node0);
    if (l_error!=0)
    {
      if(l_handle != 0xFF)
      {
          lin_descript_list_node0[l_handle].l_status = l_error;
      }
      lin_last_errors_node0[(((U8)lin_error_number_node0) & (LIN_LAST_ERR_LENGHT-1))] \
                      = ((((U16)l_handle)<<8) | ((U16)l_error))            ;
      lin_error_number_node0++;
      lin_handle_node0 = 0xFF;  // End of communication
    }
    // Here the communication go on only in case no error is detected!!!
    else
    {
        usart_lin_set_node_action(usart_lin_node0,lin_descript_list_node0[l_handle].l_cmd);

