avrxml/asf/avr32/services/network/lin/lin.c
        if(l_handle != 0xFF)
        {
#if USART_LIN_VERSION == LIN_2x
            // Configure Parity
            usart_lin_enable_parity(usart_lin_node0,true);
            // Configure Checksum
            usart_lin_enable_checksum(usart_lin_node0,true);
            // Configure Checksum Type
            usart_lin_set_checksum(usart_lin_node0,USART_LIN_ENHANCED_CHECKSUM);
            // Configure Frameslot
            usart_lin_enable_frameslot(usart_lin_node0,false);
            // Configure Frame Length
            usart_lin_set_data_length_lin2x(usart_lin_node0,lin_descript_list_node0[l_handle].l_dlc);
#elif USART_LIN_VERSION == LIN_1x
            // Configure Parity
            usart_lin_enable_parity(usart_lin_node0,true);
            // Configure Checksum
            usart_lin_enable_checksum(usart_lin_node0,true);
            // Configure Checksum Type
            usart_lin_set_checksum(usart_lin_node0,USART_LIN_CLASSIC_CHECKSUM);
            // Configure Frameslot
            usart_lin_enable_frameslot(usart_lin_node0,false);
            // Configure Frame Length
            usart_lin_set_data_length_lin1x(usart_lin_node0);
#endif

            // Diagnostic frames in LIN 2.0/2.1
            if((usart_lin_get_id_char(usart_lin_node0)>=60)) {
                usart_lin_set_checksum(usart_lin_node0,USART_LIN_CLASSIC_CHECKSUM);
                // Configure Frame Length
                usart_lin_set_data_length_lin1x(usart_lin_node0);
            }

            switch (lin_descript_list_node0[l_handle].l_cmd)
            {
                //------------
                case  PUBLISH:
                    lin_tx_response (      0,
                                           l_handle,
                                           lin_descript_list_node0[l_handle].l_pt_data,
                                           lin_descript_list_node0[l_handle].l_dlc) ;
                    break;
                //------------
                case SUBSCRIBE:
                    lin_rx_response (      0,
                                           l_handle,
                                           lin_descript_list_node0[l_handle].l_dlc) ;
                    break;
                //------------
                case IGNORE:
                default:
                    lin_handle_node0 = 0xFF;  // End of communication
                    break;
            }
        }
    }
}

#ifdef USART_LIN_NODE1_INSTANCE
/*! \brief LIN TX PDCA interrupt handler.
 */
#if defined (__GNUC__) && defined (__AVR32__)
__attribute__((__interrupt__))
#elif defined (__ICCAVR32__)
#pragma handler = USART_LIN_NODE1_TX_PDCA_IRQ_GROUP, USART_LIN_NODE1_TX_PDCA_CHANNEL
__interrupt
#endif
static void lin_pdca_int_tx_handler_node1(void)
{
  U8 index = 0;
  U8 l_handle = 0xFF;
  // Check ID Value for the current message
  for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE1; index ++)
  {
      if(lin_descript_list_node1[index].l_id == usart_lin_get_id_char(usart_lin_node1))
      {
          l_handle = index;
                    break;
      }
  }

  // Check if the ID received is registered into the lin description list
  if (l_handle!=0xFF)
  {
    if (pdca_get_transfer_status(USART_LIN_NODE1_TX_PDCA_CHANNEL)&PDCA_TRANSFER_COMPLETE)
    {
        pdca_disable_interrupt_transfer_complete(USART_LIN_NODE1_TX_PDCA_CHANNEL);
        // Start of the associated task
        lin_descript_list_node1[l_handle].l_pt_function(lin_descript_list_node1[l_handle].l_pt_data);
        lin_handle_node1 = 0xFF;  // End of communication
    }
  }
}

/*! \brief USART LIN RX PDCA interrupt handler.
 */
#if defined (__GNUC__) && defined (__AVR32__)
__attribute__((__interrupt__))
#elif defined (__ICCAVR32__)
#pragma handler = USART_LIN_NODE1_RX_PDCA_IRQ_GROUP, USART_LIN_NODE1_RX_PDCA_CHANNEL
__interrupt
#endif
static void lin_pdca_int_rx_handler_node1(void)
{
  U8 index = 0;
  U8 l_handle = 0xFF;
  // Check ID Value for the current message
  for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE1; index ++)
  {
      if(lin_descript_list_node1[index].l_id == usart_lin_get_id_char(usart_lin_node1))
      {
          l_handle = index;
                    break;
      }
  }

  // Check if the ID received is registered into the lin description list
  if (l_handle!=0xFF)
  {
    if (pdca_get_transfer_status(USART_LIN_NODE1_RX_PDCA_CHANNEL)&PDCA_TRANSFER_COMPLETE)
    {
        pdca_disable_interrupt_transfer_complete(USART_LIN_NODE1_RX_PDCA_CHANNEL);
        lin_get_response (1,lin_descript_list_node1[l_handle].l_pt_data);
        // Start of the associated task
        lin_descript_list_node1[l_handle].l_pt_function(lin_descript_list_node1[l_handle].l_pt_data);
        lin_handle_node1 = 0xFF;  // End of communication
    }
  }
}
/*! \brief USART LIN interrupt handler: manage ID reception and ERROR
 */
#if defined (__GNUC__) && defined (__AVR32__)
__attribute__((__interrupt__))
#elif defined (__ICCAVR32__)
__interrupt
#endif
static void lin_int_handler_node1(void)
{
    U32 l_error;
    U8 index;
    U8 l_handle = 0xFF;
    // Check ID Value for the current message
    for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE1; index ++)
    {
        if(lin_descript_list_node1[index].l_id == usart_lin_get_id_char(usart_lin_node1))
        {
            l_handle = index;
              break;
        }
    }

    // Check Error Status
    l_error = usart_lin_get_error(usart_lin_node1);
    usart_reset_status(usart_lin_node1);
    if (l_error!=0)
    {
      if(l_handle != 0xFF)
      {
          lin_descript_list_node1[l_handle].l_status = l_error;
      }
      lin_last_errors_node1[(((U8)lin_error_number_node1) & (LIN_LAST_ERR_LENGHT-1))] \
                      = ((((U16)l_handle)<<8) | ((U16)l_error))            ;
      lin_error_number_node1++;
      lin_handle_node1 = 0xFF;  // End of communication
    }
    // Here the communication go on only in case no error is detected!!!
    else
    {
        usart_lin_set_node_action(usart_lin_node1,lin_descript_list_node1[l_handle].l_cmd);

        if(l_handle != 0xFF) {
#if USART_LIN_VERSION == LIN_2x
            // Configure Parity
            usart_lin_enable_parity(usart_lin_node1,true);
            // Configure Checksum
            usart_lin_enable_checksum(usart_lin_node1,true);
            // Configure Checksum Type
            usart_lin_set_checksum(usart_lin_node1,USART_LIN_ENHANCED_CHECKSUM);
            // Configure Frameslot
            usart_lin_enable_frameslot(usart_lin_node1,false);
            // Configure Frame Length
            usart_lin_set_data_length_lin2x(usart_lin_node1,lin_descript_list_node1[l_handle].l_dlc);
#elif USART_LIN_VERSION == LIN_1x
            // Configure Parity
            usart_lin_enable_parity(usart_lin_node1,true);
            // Configure Checksum
            usart_lin_enable_checksum(usart_lin_node1,true);
            // Configure Checksum Type
            usart_lin_set_checksum(usart_lin_node1,USART_LIN_CLASSIC_CHECKSUM);
            // Configure Frameslot
            usart_lin_enable_frameslot(usart_lin_node1,false);
            // Configure Frame Length
            usart_lin_set_data_length_lin1x(usart_lin_node1);
#endif

            // Diagnostic frames in LIN 2.0/2.1
            if((usart_lin_get_id_char(usart_lin_node1)>=60))
            {
                usart_lin_set_checksum(usart_lin_node1,USART_LIN_CLASSIC_CHECKSUM);
                // Configure Frame Length
                usart_lin_set_data_length_lin1x(usart_lin_node1);
            }

            switch (lin_descript_list_node1[l_handle].l_cmd)
            {
                //------------
                case  PUBLISH:
                    lin_tx_response (      1,
                                           l_handle,
                                           lin_descript_list_node1[l_handle].l_pt_data,
                                           lin_descript_list_node1[l_handle].l_dlc) ;
                    break;
                //------------
                case SUBSCRIBE:
                    lin_rx_response (      1,
                                           l_handle,
                                           lin_descript_list_node1[l_handle].l_dlc) ;
                    break;
                //------------
                case IGNORE:
                default:
                    lin_handle_node1 = 0xFF;  // End of communication
                    break;
            }
        }
    }
}
#endif
//------------------------------------------------------------------------------
/*! \name Initialization Functions
 */
//! @{

/*! \brief  This function initializes the LIN controller and, if needed, the LIN
 *          interrupts.
 *
 * \param master \c true for master, \c false for slave
 * \param l_node Node Value
 * \param b_rate Baudrate Value
 * \param pba_hz PBA Value
 * \return Status PASS / FAIL
 *
 */
U8 lin_init (bool master,
             U8 l_node,
             U16 b_rate,
             long pba_hz) {
if (l_node == 0)
{
    // Enable GPIO Alternate Functions
    gpio_enable_module(USART_LIN_NODE0_GPIO_MAP,
                     sizeof(USART_LIN_NODE0_GPIO_MAP) / sizeof(USART_LIN_NODE0_GPIO_MAP[0]));

    gpio_enable_pin_pull_up(USART_LIN_NODE0_RX_PIN);

    // USART options.
    if (master)
      usart_init_lin_master(usart_lin_node0,b_rate,pba_hz);
    else
      usart_init_lin_slave(usart_lin_node0,b_rate,pba_hz);

