avrxml/asf/avr32/services/network/lin/lin.c
        switch (lin_descript_list_node0[l_handle].l_cmd)
        {
            // In Publish, the USART Send the Header and the response
            case PUBLISH:
                  lin_tx_header_and_response(0,l_handle,l_len);
              break;
            // In Subscribe, the USART Receive the response
            case SUBSCRIBE:
            	  usart_lin_set_id_char(usart_lin_node0,l_id);
            	  lin_rx_response(0,l_handle,l_len);
              break;
            default:
              break;
        }
        return PASS;
    }
    else
    {
        return FAIL;
    }
}
#ifdef USART_LIN_NODE1_INSTANCE
else
{
    // Clear error in case of previous communication
    usart_reset_status(usart_lin_node1);

    for(index = 0; index < NUMBER_OF_LIN_FRAMES_NODE1; index ++) {
        if(lin_descript_list_node1[index].l_id == l_id) {
            l_handle = index;
	          break;
        }
    }

    if(l_handle != 0xFF) {

        usart_lin_set_node_action(usart_lin_node1,lin_descript_list_node1[l_handle].l_cmd);

#if USART_LIN_VERSION == LIN_2x
        // Configure Parity
        usart_lin_enable_parity(usart_lin_node1,true);
        // Configure Checksum
        usart_lin_enable_checksum(usart_lin_node1,true);
        // Configure Checksum Type
        usart_lin_set_checksum(usart_lin_node1,USART_LIN_ENHANCED_CHECKSUM);
        // Configure Frameslot
        usart_lin_enable_frameslot(usart_lin_node1,false);
        // Configure Frame Length
        usart_lin_set_data_length_lin2x(usart_lin_node1,l_len);
#elif USART_LIN_VERSION == LIN_1x
        // Configure Parity
        usart_lin_enable_parity(usart_lin_node1,true);
        // Configure Checksum
        usart_lin_enable_checksum(usart_lin_node1,true);
        // Configure Checksum Type
        usart_lin_set_checksum(usart_lin_node1,USART_LIN_CLASSIC_CHECKSUM);
        // Configure Frameslot
        usart_lin_enable_frameslot(usart_lin_node1,false);
        // Configure Frame Length
        usart_lin_set_data_length_lin1x(usart_lin_node1);
#endif
        // Switch to Classic Checksum if diagnostic ID request
        if (lin_descript_list_node1[l_handle].l_id>=60)
        {
                usart_lin_set_checksum(usart_lin_node1,USART_LIN_CLASSIC_CHECKSUM);
                // Configure Frame Length
                usart_lin_set_data_length_lin1x(usart_lin_node1);
        }

        switch (lin_descript_list_node0[l_handle].l_cmd)
        {
            // In Publish, the USART Send the Header and the response
            case PUBLISH:
                  lin_tx_header_and_response(1,l_handle,l_len);
              break;
            // In Subscribe, the USART Receive the response
            case SUBSCRIBE:
            	  usart_lin_set_id_char(usart_lin_node1,l_id);
            	  lin_rx_response(1,l_handle,l_len);
              break;
            default:
              break;
        }
        return PASS;
    }
    else
    {
        return FAIL;
    }
}
#endif
}

/*! \brief  This function commands the sending of a LIN header and response, MASTER task only
 *
 * \param l_node Node Value
 * \param l_handle  Handle on the descriptor list
 * \param l_len     Message length corresponding to the message pointed by the handle in the descriptor list
 *
 * \return Status PASS / FAIL
 *
 */
static U8 lin_tx_header_and_response( U8 l_node,
                                      U8 l_handle,
                                      U8 l_len
                                     )
{
if (l_node == 0)
{
        //! Enable Interrupt for Error flags and end ID Reception
        #if ( defined (AVR32_USART_400_H_INCLUDED) ||  \
              defined (AVR32_USART_410_H_INCLUDED) ||  \
              defined (AVR32_USART_420_H_INCLUDED) )
          // PDCA channel options
          pdca_channel_options_t USART_LIN_PDCA_OPTIONS =
          {
            .addr           = (void *)lin_tx_buffer_node0,   // memory address
            .pid            = USART_LIN_NODE0_PDCA_PID_TX,       // select peripheral - data are transmit on USART TX line.
            .size           = (l_len+1),           // transfer counter
            .r_addr         = NULL, // next memory address
            .r_size         = 0,	   // next transfer counter
            .transfer_size  = PDCA_TRANSFER_SIZE_BYTE // select size of the transfer
          };

          pdca_init_channel(USART_LIN_NODE0_TX_PDCA_CHANNEL, &USART_LIN_PDCA_OPTIONS);

          // Copy data of the data contained in the descriptor list into the tx buffer of the PDCA
          memcpy(&lin_tx_buffer_node0[1],lin_descript_list_node0[l_handle].l_pt_data,l_len);

          pdca_enable_interrupt_transfer_complete(USART_LIN_NODE0_TX_PDCA_CHANNEL);

          // Set the ID First
          lin_tx_buffer_node0[0] = lin_descript_list_node0[l_handle].l_id;

          // Start PDCA transfer ID + Data
          pdca_enable(USART_LIN_NODE0_TX_PDCA_CHANNEL);

          usart_lin_set_id_char(usart_lin_node0,lin_descript_list_node0[l_handle].l_id);
      #else
          // PDCA channel options
          pdca_channel_options_t USART_LIN_PDCA_OPTIONS =
          {
            .addr           = (void *)lin_tx_buffer_node0,   // memory address
            .pid            = USART_LIN_NODE0_PDCA_PID_TX,       // select peripheral - data are transmit on USART TX line.
            .size           = (l_len+1),           // transfer counter
            .r_addr         = NULL, // next memory address
            .r_size         = 0,	   // next transfer counter
            .transfer_size  = PDCA_TRANSFER_SIZE_BYTE // select size of the transfer
          };

          pdca_init_channel(USART_LIN_NODE0_TX_PDCA_CHANNEL, &USART_LIN_PDCA_OPTIONS);

          // Copy data of the data contained in the descriptor list into the tx buffer of the PDCA
          memcpy(&lin_tx_buffer_node0[1],lin_descript_list_node0[l_handle].l_pt_data,l_len);

          pdca_enable_interrupt_transfer_complete(USART_LIN_NODE0_TX_PDCA_CHANNEL);

          // Set the ID First
          lin_tx_buffer_node0[0] = lin_descript_list_node0[l_handle].l_id;

